blog/2014/12/03/why-this-year-im-focusing-on-charity/index.html
<!DOCTYPE html>
<html lang="en-us">
  <head>
  <title>Why this Year I&#39;m Focusing on Charity. - Katherine Cox-Buday</title>
  <meta charset="utf-8" />
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="author" content="Katherine Cox-Buday" />

  <!-- Mobile support -->
  <meta name="viewport" content="width=device-width, initial-scale=1">

  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <!-- <link rel="stylesheet" href="/media/css/prettify.css" type="text/css"> -->

  <!-- Latest compiled and minified CSS -->
  <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.1/css/bootstrap.min.css">
  <!-- Optional theme -->
  <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.1/css/bootstrap-theme.min.css">
  <!-- Latest compiled and minified JavaScript -->
  <link href="https://maxcdn.bootstrapcdn.com/font-awesome/4.2.0/css/font-awesome.min.css" rel="stylesheet">
</head>

  <body>
    <div class="container">
      <div class="row">
        <div class="col-sm-9 blog-main">
          <div class="post">
  <div class="col-sm-3 right-align post-meta">
    <h3>&nbsp;<!-- Placeholder for alignment with post --></h3>
  </div>
  <div class="col-sm-9">
    <div class="post">
      <h3>Why this Year I&#39;m Focusing on Charity.</h3>
      <p>
I am fortunate in my life that I have nurtured a career that not only helps to sustain my family but allows me enough money to enjoy some recreational things. It is for this reason that I'm not sure whether my growing distaste for consumerism has just come with age, or if it's because I can afford things I would like. Either way, I have come to loathe this time of year in The United States.
</p>

<p>
I feel inundated by commercials telling me to buy now, that I should get what I really want this year. Here's a BMW that I deserve. Here's a diamond necklace he had better get me. Here's me suppressing a gag reflex.
</p>

<p>
I'm not out and out against people wanting things -- or gifts. That's all fine (I even have a few items on my list). It's the exuberance of what the last fourth of the year has come to represent. We have an entire season of procurement and societal greed. I've reached a tipping point in my life where the very idea of me sitting down and putting thought into a list of more things I want to acquire leaves a bad taste in my mouth. I don't need more stuff -- no matter how hard the advertising industry tries to sell it. What I would like to do this year is cultivate compassion, and establish a pattern my newborn daughter can look up to. When I think of this time of year, I don't want to think of the exuberance of excess, I want to think of others, and how I can possibly contribute in some small way to the betterment of the world.
</p>

<p>
So last night I sat down and I did make a list. I made a list of charities I'd like to support this year, and going forward. If you're in a position where you don't really need anything, I encourage you to at least stop and think about what this time of year means to you, and whether more things will really enhance your life.
</p>

<p>
Happy holidays, everyone.
</p>

<p>
Katherine
</p>

<ul class="org-ul">
<li>NAMI (<a href="http://www.charitynavigator.org/index.cfm?bay%3Dsearch.summary&amp;orgid%3D4827">National Alliance on Mental Illness</a>)</li>
<li>HRC (<a href="http://www.charitynavigator.org/index.cfm?bay%3Dsearch.summary&amp;orgid%3D6229">The Human Rights Campaign</a>)</li>
<li>WWF (<a href="http://www.charitynavigator.org/index.cfm?bay%3Dsearch.summary&amp;orgid%3D4770">World Wildlife Fund</a>)</li>
<li>Wikimedia Foundation (<a href="http://www.charitynavigator.org/index.cfm?bay%3Dsearch.summary&amp;orgid%3D11212">Wikipedia</a>)</li>
</ul>

    </div>
  </div>
</div> <!-- /.container -->

        </div> <!-- /.blog-main -->
        <div class="col-sm-3 blog-sidebar">
          <div class="sidebar-module sidebar-module-inset">
  <a href="/"><span class="fa fa-home fa-2x"></span></a>
  <a href="/rss.xml"><span class="fa fa-rss-square fa-2x"></span></a>
  <a href="/tags/"><span class="fa fa-tags fa-2x"></span></a>
</div>
<div class="sidebar-module">
  <form method="get" id="searchform" action="http://www.google.com/search">
    <input type="text" class="form-control" name="q" id="s" placeholder="Search">
    <input type="hidden" name="q" value="site:katherine.cox-buday.com">
  </form>
</div>
<div class="sidebar-module">
  <h4>Categories</h4>
  <ol class="list-unstyled">
    <li><a href="/blog/">Blog</a></li>
    <li><a href="/concurrency-in-go/">Concurrency in Go</a></li>
    <li><a href="/talks/">Talks</a></li>
    <!-- <li><a href="https://github.com/kelvinh/org-page">GitHub</a></li> -->
  </ol>
</div>
        </div> <!-- /.blog-sidebar -->
      </div> <!-- /.row -->
    </div> <!-- /.container -->
    <script src="//code.jquery.com/jquery-latest.min.js"></script>
<script src="//maxcdn.bootstrapcdn.com/bootstrap/3.3.1/js/bootstrap.min.js"></script>
<script src="https://google-code-prettify.googlecode.com/svn/loader/prettify.js"></script>
<script src="/media/js/main.js"></script>
<!-- HTML5 shim and Respond.js for IE8 support of HTML5 elements and media queries -->
<!--[if lt IE 9]>
    <script src="https://oss.maxcdn.com/html5shiv/3.7.2/html5shiv.min.js"></script>
    <script src="https://oss.maxcdn.com/respond/1.4.2/respond.min.js"></script>
<![endif]-->
<div class="container">
  <script type="text/javascript">
    $('.post-meta').append('<ul class="list-unstyled"><li><span title="post date" class="post-info">2014-12-03</span></li><li><span title="tags" class="post-info"><a href="/tags/personal/">personal</a></span></li></ul>');
  </script>
</div> <!-- /.container -->

<footer class="footer">
  <div class="container text-muted">
    <div class="row" style="heigh:2em;">
      <div class="col-md-2 vertical-center">
        <a href="https://github.com/kat-co"><span class="fa fa-github-square fa-2x"></span></a>
        <a href="http://www.linkedin.com/in/katherinecoxbuday"><span class="fa fa-linkedin-square fa-2x"></span></a>
        <a href="https://twitter.com/katco_"><span class="fa fa-twitter-square fa-2x"></span></a>
      </div>
      <div class="col-sm-9 vertical-center">
        Copyright &copy; <a href="mailto:cox &lt;dot&gt; katherine &lt;dot&gt; e &lt;at&gt; gmail &lt;dot&gt; com">Katherine Cox-Buday</a>,
        Generated by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 27.x (<a href="http://orgmode.org">Org mode</a> 9.x) & <a href="https://github.com/kelvinh/org-page" target="_blank">org-page</a>
      </div>
    </div> <!-- ./row -->
  </div> <!-- ./container -->
</footer>

  </body>
</html>
